Revit 2027 API
BooleanOperationsType Enumeration
 An enumerated type listing boolean types that are supported for boolean operation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BooleanOperationsType
Public Enumeration BooleanOperationsType
public enum class BooleanOperationsType
type BooleanOperationsType
Members
Member name | Value | Description
Difference | 1 |  Difference.
Intersect | 2 |  Intersect.
Union | 0 |  Union.
See Also
Reference
Autodesk.Revit.DB Namespace